#Область ОбработчикиСобытийЭлементовТаблицыФормы 
 
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ПересчитатьСуммуВСтрокеПриИзменении(Элементы.Товары.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ПересчитатьСуммуВСтрокеПриИзменении(Элементы.Товары.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииПриИзменнии

&НаКлиенте
Процедура ПересчитатьСуммуВСтрокеПриИзменении(СтрокаТабличнойЧасти)
	
	Если НЕ СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	КонецЕсли;
	

КонецПроцедуры 

#КонецОбласти